Catalogs/ДМ_КонтролируемыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДМ_КонтролируемыеПоказатели</Name>
			<Comment>Контролируемые показатели монитора состояния системы.</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньВложенности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДМ_КонтролируемыеПоказатели/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДатаСостояния = ТекущаяДата();
	ЭтотОбъект.УровеньВложенности = ЭтотОбъект.Уровень();
	ЭтотОбъект.ПолныйКодЭлемента = ЭтотОбъект.ПолныйКод();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЭтоНовый() Тогда
		
		лЗапрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДМ_КонтролируемыеПоказатели.КодСостояния) КАК КодСостояния
		|ИЗ
		|	Справочник.ДМ_КонтролируемыеПоказатели КАК ДМ_КонтролируемыеПоказатели
		|ГДЕ
		|	ДМ_КонтролируемыеПоказатели.Ссылка В ИЕРАРХИИ(&Родитель)
		|	И ДМ_КонтролируемыеПоказатели.Ссылка <> &Родитель"
		);
		лЗапрос.УстановитьПараметр( "Родитель", ЭтотОбъект.Ссылка );
		лРезультат = лЗапрос.Выполнить();
		лВыборка = лРезультат.Выбрать();
		Если лВыборка.Следующий() Тогда
		
			Если лВыборка.КодСостояния <> NULL И ЭтотОбъект.КодСостояния < лВыборка.КодСостояния Тогда
				ЭтотОбъект.КодСостояния = лВыборка.КодСостояния;
			КонецЕсли;
		
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта( ЭтотОбъект.Ссылка, "КодСостояния" ) <> ЭтотОбъект.КодСостояния Тогда
			ЭтотОбъект.ДатаИзмененияСостояния = ЭтотОбъект.ДатаСостояния;
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.ДатаИзмененияСостояния = ЭтотОбъект.ДатаСостояния;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено( ЭтотОбъект.Родитель )
		И ЭтотОбъект.КодСостояния <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка,"КодСостояния")
		Тогда
		
		ЭтотОбъект.ДополнительныеСвойства.Вставить("УстановитьКодСостояния", Истина );
		
	Иначе
		
		ЭтотОбъект.ДополнительныеСвойства.Вставить("УстановитьКодСостояния", Ложь );
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДатаСостояния = ТекущаяДата();
	
	Если ЗначениеЗаполнено( ЭтотОбъект.Родитель )
		И ЭтотОбъект.ДополнительныеСвойства.УстановитьКодСостояния = Истина
		Тогда
		
		лЗапрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДМ_КонтролируемыеПоказатели.КодСостояния) КАК КодСостояния,
		|	ДМ_КонтролируемыеПоказатели.Родитель КАК Родитель
		|ИЗ
		|	Справочник.ДМ_КонтролируемыеПоказатели КАК ДМ_КонтролируемыеПоказатели
		|ГДЕ
		|	ДМ_КонтролируемыеПоказатели.Родитель = &Родитель
		|
		|СГРУППИРОВАТЬ ПО
		|	ДМ_КонтролируемыеПоказатели.Родитель"
		);
		лЗапрос.УстановитьПараметр( "Родитель", ЭтотОбъект.Родитель );
		лРезультат = лЗапрос.Выполнить();
		лВыборка = лРезультат.Выбрать();
		Если лВыборка.Следующий() Тогда
		
			лРодитель = ЭтотОбъект.Родитель.ПолучитьОбъект();
			лРодитель.Заблокировать();
			лРодитель.КодСостояния = лВыборка.КодСостояния;
			лРодитель.Записать();
			лРодитель.Разблокировать();
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
